notes/20260115215958-org_modern_test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-19 Mon 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org modern test</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">org modern test</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4435a51">1. Headlines</a>
<ul>
<li><a href="#org631a3e7">1.1. Second level</a>
<ul>
<li><a href="#orgf6d2922">1.1.1. Third level</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd81fc50">2. Task Lists <code>[1/3]</code></a>
<ul>
<li><a href="#orgcf345c2">2.1. <span class="done DONE">DONE</span> Write <code>org-modern</code></a></li>
<li><a href="#orgb673551">2.2. <span class="todo TODO">TODO</span> Publish <code>org-modern</code></a></li>
<li><a href="#org98cc4d2">2.3. <span class="todo TODO">TODO</span> Fix all the bugs</a></li>
</ul>
</li>
<li><a href="#orgf9e320e">3. List Bullets</a>
<ul>
<li><a href="#orgde9f9ad">3.1. Dash</a></li>
<li><a href="#orgf9ee4f2">3.2. Plus</a></li>
<li><a href="#orgfa8b999">3.3. Asterisk</a></li>
</ul>
</li>
<li><a href="#orge24aeda">4. Timestamps</a></li>
<li><a href="#org7b7113f">5. Blocks</a></li>
<li><a href="#orgc7a5ddf">6. Todo Labels and Tags</a>
<ul>
<li><a href="#org2ddd92e">6.1. <span class="done DONE">DONE</span> Write <code>org-modern</code></a></li>
<li><a href="#org97578c3">6.2. <span class="todo TODO">TODO</span> Publish <code>org-modern</code></a></li>
<li><a href="#orgb541a9b">6.3. WAIT Fix all the bugs</a></li>
</ul>
</li>
<li><a href="#orgb26f72c">7. Priorities</a>
<ul>
<li><a href="#orgba223db">7.1. <span class="done DONE">DONE</span> Most important</a></li>
<li><a href="#org179510a">7.2. <span class="todo TODO">TODO</span> Less important</a></li>
<li><a href="#orgb5fcde6">7.3. CANCEL [#C] Not that important</a></li>
<li><a href="#orge7b6b60">7.4. <span class="done DONE">DONE</span> <code>[100%]</code> [#A] Everything combined</a>
<ul>
<li><a href="#orgd0ea6fa">7.4.1. <span class="done DONE">DONE</span> First</a></li>
<li><a href="#orge056b22">7.4.2. <span class="done DONE">DONE</span> Second</a></li>
<li><a href="#org6a4dd08">7.4.3. <span class="done DONE">DONE</span> Third</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdbb4f7f">8. Tables</a></li>
<li><a href="#org8e0383d">9. Special Links</a></li>
</ul>
</div>
</div>
<p>
This example Org file demonstrates the Org elements,
which are styled by <code>org-modern</code>.
</p>
<div id="outline-container-org4435a51" class="outline-2">
<h2 id="org4435a51"><span class="section-number-2">1.</span> Headlines</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org631a3e7" class="outline-3">
<h3 id="org631a3e7"><span class="section-number-3">1.1.</span> Second level</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf6d2922" class="outline-4">
<h4 id="orgf6d2922"><span class="section-number-4">1.1.1.</span> Third level</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org134fbd6"></a>Fourth level<br />
<ol class="org-ol">
<li><a id="org1724ac3"></a>Fifth level<br /></li>
</ol>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd81fc50" class="outline-2">
<h2 id="orgd81fc50"><span class="section-number-2">2.</span> Task Lists <code>[1/3]</code></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcf345c2" class="outline-3">
<h3 id="orgcf345c2"><span class="section-number-3">2.1.</span> <span class="done DONE">DONE</span> Write <code>org-modern</code></h3>
</div>
<div id="outline-container-orgb673551" class="outline-3">
<h3 id="orgb673551"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> Publish <code>org-modern</code></h3>
</div>
<div id="outline-container-org98cc4d2" class="outline-3">
<h3 id="org98cc4d2"><span class="section-number-3">2.3.</span> <span class="todo TODO">TODO</span> Fix all the bugs</h3>
</div>
</div>
<div id="outline-container-orgf9e320e" class="outline-2">
<h2 id="orgf9e320e"><span class="section-number-2">3.</span> List Bullets</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgde9f9ad" class="outline-3">
<h3 id="orgde9f9ad"><span class="section-number-3">3.1.</span> Dash</h3>
</div>
<div id="outline-container-orgf9ee4f2" class="outline-3">
<h3 id="orgf9ee4f2"><span class="section-number-3">3.2.</span> Plus</h3>
</div>
<div id="outline-container-orgfa8b999" class="outline-3">
<h3 id="orgfa8b999"><span class="section-number-3">3.3.</span> Asterisk</h3>
</div>
</div>
<div id="outline-container-orge24aeda" class="outline-2">
<h2 id="orge24aeda"><span class="section-number-2">4.</span> Timestamps</h2>
<div class="outline-text-2" id="text-4">
<p>
DRANGE:    <span class="timestamp-wrapper"><span class="timestamp">[2022-03-01 Tue]&#x2013;[2022-04-01 Fri]</span></span>
DRANGE:    <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-01 Tue&gt;&#x2013;&lt;2022-04-01 Fri&gt;</span></span>
TRANGE:    <span class="timestamp-wrapper"><span class="timestamp">[2022-03-01 Tue 10:42-11:00]</span></span>
TIMESTAMP: <span class="timestamp-wrapper"><span class="timestamp">[2022-02-21 Mon 13:00]</span></span>
DREPEATED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-26 Sat .+1d&gt;</span></span>
TREPEATED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-26 Sat 10:00 .+1d&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-org7b7113f" class="outline-2">
<h2 id="org7b7113f"><span class="section-number-2">5.</span> Blocks</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Taken from the well-structured Emacs config by @oantolin.</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Take a look at https://github.com/oantolin/emacs-config!</span>
(<span style="color: #531ab6; font-weight: bold;">defun</span> <span style="color: #721045;">command-of-the-day</span> ()
  <span style="color: #2a5045; font-style: italic;">"Show the documentation for a random command."</span>
  (<span style="color: #531ab6; font-weight: bold;">interactive</span>)
  (<span style="color: #531ab6; font-weight: bold;">let</span> ((commands))
        (mapatoms (<span style="color: #531ab6; font-weight: bold;">lambda</span> (s) (<span style="color: #531ab6; font-weight: bold;">when</span> (commandp s) (<span style="color: #531ab6; font-weight: bold;">push</span> s commands))))
        (describe-function (nth (random (length commands)) commands))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-calc">taylor(sin(x),x=0,3)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-C">printf(<span style="color: #3548cf;">"a|b\nc|d\n"</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7a5ddf" class="outline-2">
<h2 id="orgc7a5ddf"><span class="section-number-2">6.</span> Todo Labels and Tags</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org2ddd92e" class="outline-3">
<h3 id="org2ddd92e"><span class="section-number-3">6.1.</span> <span class="done DONE">DONE</span> Write <code>org-modern</code></h3>
</div>
<div id="outline-container-org97578c3" class="outline-3">
<h3 id="org97578c3"><span class="section-number-3">6.2.</span> <span class="todo TODO">TODO</span> Publish <code>org-modern</code></h3>
</div>
<div id="outline-container-orgb541a9b" class="outline-3">
<h3 id="orgb541a9b"><span class="section-number-3">6.3.</span> WAIT Fix all the bugs</h3>
</div>
</div>
<div id="outline-container-orgb26f72c" class="outline-2">
<h2 id="orgb26f72c"><span class="section-number-2">7.</span> Priorities</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgba223db" class="outline-3">
<h3 id="orgba223db"><span class="section-number-3">7.1.</span> <span class="done DONE">DONE</span> Most important</h3>
</div>
<div id="outline-container-org179510a" class="outline-3">
<h3 id="org179510a"><span class="section-number-3">7.2.</span> <span class="todo TODO">TODO</span> Less important</h3>
</div>
<div id="outline-container-orgb5fcde6" class="outline-3">
<h3 id="orgb5fcde6"><span class="section-number-3">7.3.</span> CANCEL [#C] Not that important</h3>
</div>
<div id="outline-container-orge7b6b60" class="outline-3">
<h3 id="orge7b6b60"><span class="section-number-3">7.4.</span> <span class="done DONE">DONE</span> <code>[100%]</code> [#A] Everything combined</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-orgd0ea6fa" class="outline-4">
<h4 id="orgd0ea6fa"><span class="section-number-4">7.4.1.</span> <span class="done DONE">DONE</span> First</h4>
</div>
<div id="outline-container-orge056b22" class="outline-4">
<h4 id="orge056b22"><span class="section-number-4">7.4.2.</span> <span class="done DONE">DONE</span> Second</h4>
</div>
<div id="outline-container-org6a4dd08" class="outline-4">
<h4 id="org6a4dd08"><span class="section-number-4">7.4.3.</span> <span class="done DONE">DONE</span> Third</h4>
</div>
</div>
</div>
<div id="outline-container-orgdbb4f7f" class="outline-2">
<h2 id="orgdbb4f7f"><span class="section-number-2">8.</span> Tables</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">N</th>
<th scope="col" class="org-right">N<sup>2</sup></th>
<th scope="col" class="org-right">N<sup>3</sup></th>
<th scope="col" class="org-right">N<sup>4</sup></th>
<th scope="col" class="org-right">sqrt(n)</th>
<th scope="col" class="org-right">sqrt[4](N)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">8</td>
<td class="org-right">16</td>
<td class="org-right">1.4142</td>
<td class="org-right">1.1892</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">9</td>
<td class="org-right">27</td>
<td class="org-right">81</td>
<td class="org-right">1.7321</td>
<td class="org-right">1.3161</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">N</th>
<th scope="col" class="org-right">N<sup>2</sup></th>
<th scope="col" class="org-right">N<sup>3</sup></th>
<th scope="col" class="org-right">N<sup>4</sup></th>
<th scope="col" class="org-right">sqrt(n)</th>
<th scope="col" class="org-right">sqrt[4](N)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">8</td>
<td class="org-right">16</td>
<td class="org-right">1.4142</td>
<td class="org-right">1.1892</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">9</td>
<td class="org-right">27</td>
<td class="org-right">81</td>
<td class="org-right">1.7321</td>
<td class="org-right">1.3161</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8e0383d" class="outline-2">
<h2 id="org8e0383d"><span class="section-number-2">9.</span> Special Links</h2>
<div class="outline-text-2" id="text-9">
<p>
Test numeric footnotes<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and named footnotes<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
<a id="org646411d"></a>
</p>

<p>
<a id="orgcec0acf">radio link</a>
</p>

<p>
<a href="#org646411d">9</a>
</p>

<p>
<a href="#orgcec0acf">radio link</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is footnote 1
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is the footnote
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2026-01-19 Mon 22:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
